In [8]:
import pandas as pd
import numpy as np

# Criação de um dataframe de teste com valores nulos para usar de exemplo

df_salarios = pd.DataFrame({
    'nome': ["Ana", "Bruno", "Carlos", "Daniele", "Val"],
    'salario': [4000, np.nan, 5000, np.nan, 100000]
})

display(df_salarios)

      nome   salario
0      Ana    4000.0
1    Bruno       NaN
2   Carlos    5000.0
3  Daniele       NaN
4      Val  100000.0

In [6]:
## Preenchimento de valores nulos com média e mediana

### Calcula a média salarial e substitui os nulos pela média e arrededonda os valores
df_salarios['salario_media'] = df_salarios['salario'].fillna(df_salarios['salario'].mean().round(2))

### Calcula mediana e substitui os nulos pela mediana
df_salarios['salario_mediana'] = df_salarios['salario'].fillna(df_salarios['salario'].median())

display(df_salarios)

      nome   salario  salario_media  salario_mediana
0      Ana    4000.0        4000.00           4000.0
1    Bruno       NaN       36333.33           5000.0
2   Carlos    5000.0        5000.00           5000.0
3  Daniele       NaN       36333.33           5000.0
4      Val  100000.0      100000.00         100000.0